# ElemRoomName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElemRoomName Property
ParameterTypeId Class See Also
---
"Room Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElemRoomName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElemRoomName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElemRoomName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace